In [ ]:
import pandas as pd

In [1]:
pd.read_csv('stock_data.csv')

   Unnamed: 0 GOOGL          27.82   87   845     larry page
0           0   WMT           4.61  484    65           n.a.
1           1  MSFT             -1   85    64     bill gates
2           2   RIL  not available   50  1023  mukesh ambani
3           3  TATA              5   -1  n.a.     ratan tata

In [2]:
pd.read_csv('stock_data.csv', header= None)

     0      1              2    3     4              5
0  NaN  GOOGL          27.82   87   845     larry page
1  0.0    WMT           4.61  484    65           n.a.
2  1.0   MSFT             -1   85    64     bill gates
3  2.0    RIL  not available   50  1023  mukesh ambani
4  3.0   TATA              5   -1  n.a.     ratan tata

In [9]:
pd.read_csv('stock_data.csv', header= None, names=['ticker','eps','revenue','price','people'])

    ticker            eps  revenue price         people
NaN  GOOGL          27.82       87   845     larry page
0.0    WMT           4.61      484    65           n.a.
1.0   MSFT             -1       85    64     bill gates
2.0    RIL  not available       50  1023  mukesh ambani
3.0   TATA              5       -1  n.a.     ratan tata

In [8]:
pd.read_csv('stock_data.csv', header= None,na_values=["not available",'n.a.'])

     0      1      2    3       4              5
0  NaN  GOOGL  27.82   87   845.0     larry page
1  0.0    WMT   4.61  484    65.0            NaN
2  1.0   MSFT  -1.00   85    64.0     bill gates
3  2.0    RIL    NaN   50  1023.0  mukesh ambani
4  3.0   TATA   5.00   -1     NaN     ratan tata

In [11]:
df= pd.read_csv('stock_data.csv', header= None, names=['ticker','eps','revenue','price','people'],na_values={'eps':['not available','n.a.'],'revenue':['not available','n.a.',-1],'people':['not available','n.a.']})

In [12]:
df

    ticker    eps  revenue price         people
NaN  GOOGL  27.82     87.0   845     larry page
0.0    WMT   4.61    484.0    65            NaN
1.0   MSFT  -1.00     85.0    64     bill gates
2.0    RIL    NaN     50.0  1023  mukesh ambani
3.0   TATA   5.00      NaN  n.a.     ratan tata

In [15]:
df.to_csv('Desktop/Pathway to DS/new.csv',index=False)

In [19]:
pd.read_csv('stock_data.csv')

   Unnamed: 0 GOOGL          27.82   87   845     larry page
0           0   WMT           4.61  484    65           n.a.
1           1  MSFT             -1   85    64     bill gates
2           2   RIL  not available   50  1023  mukesh ambani
3           3  TATA              5   -1  n.a.     ratan tata

In [25]:
df= pd.read_csv('stock_data.csv', header= None, names=['ticker','eps','revenue','price','people'],na_values={'eps':['not available','n.a.'],'revenue':['not available','n.a.',-1],'people':['not available','n.a.']})

In [26]:
df

    ticker    eps  revenue price         people
NaN  GOOGL  27.82     87.0   845     larry page
0.0    WMT   4.61    484.0    65            NaN
1.0   MSFT  -1.00     85.0    64     bill gates
2.0    RIL    NaN     50.0  1023  mukesh ambani
3.0   TATA   5.00      NaN  n.a.     ratan tata

In [31]:
def convert_people_cell(cell):
    if cell=='n.a.':
        return 'sam walton'
    return cell
pd.read_excel('Desktop/Pathway to DS/stock_data.xlsx','Sheet1',header = False, converters ={'people':convert_people_cell})

TypeError: Passing a bool to header is invalid. Use header=None for no header or header=int or list-like of ints to specify the row(s) making up the column names